/**********************************************************************************
* 功能：HY-SRF05超声波测距模块测试
* 处理器：STC89C52RC
* 晶振：11.0592
* 编译环境：Keil uVision5
* 时间：2017-5-29
* 作者：donmine
* 备注：Trig  ---  P0_0
*       Echo  ---  外部中断0(P3_2)
*       OUT   ---  
*       Vcc   ---  VCC
*       GND   ---  GND/
*********************************************************************************/
/*
#include <reg52.h>
#include <intrins.h>    //_nop_ 
#include "ultrasonic.h"
#include "delay.h"
#define uint  unsigned int
#define uchar unsigned char

sbit Trig = P2^5;*/
/******************************  初始化函数 *****************************************/
//外部中断0初始化(P3_2)
/*
void int0_init(void)  
{
    IE0 = 0;  //外部中断0标志位清0
    IT0 = 1;  //外部中断0下降沿触发
    EX0 = 1;  //外部中断0允许         
}
//定时器0初始化
void time0_init(void)  
{
    //TMOD |= 0x09;  //0000 1001: GATE门控开，只有 TRx==1 && INTx==1 才可启动T0，T0定时方式1（16位）
    TH0 = 0;  
    TL0 = 0;
    TF0 = 0;  //T0标志位清0 
    ET0 = 1;  //T0中断允许
    TR0 = 1;  //T0工作允许
}
void init(void)
{
    Trig = 0;
    time0_init();
    int0_init();
}
/************************************************************************************/

/*****************************************************************
void ultrasonic_Init(void)
{		
		init();
		Delay15ms();
		Trig = 1;
		Delay15us();//发送触发信号（10us以上TTL脉冲），如果检测到回响，Echo(P3^2)将拉高，则T0开始计时
		Trig = 0;		
}*/